//*************************************************************************
//	创建日期:	2014-11-15
//	文件名称:	FKCW_SimpleNet.h
//  创 建 人:   王宏张 FreeKnight	
//	版权所有:	MIT
//	说    明:	
//*************************************************************************

#pragma once

//-------------------------------------------------------------------------
/* 
====================================
模块说明：	
====================================
	简单的TCP连接封装，相当简单易用。
====================================
内部文件功能说明：
====================================
	FKCW_SimpleNet_NetObject
		网络对象基类。我们只需继承该类，实现其纯虚函数即可便利的创建socket并进行管理以及收发包。
		建议继承类为单件，便于客户端调用。

	FKCW_SimpleNet_Macro
		一些基本的网络相关宏
	FKCW_SimpleNet_Buffer
		流式包，便于操作封包，对于send,receive有原生支持
	FKCW_SimpleNet_InetAddress
		网络地址的封装
	FKCW_SimpleNet_TCPSocket
		TCPSocket连接封装
====================================
依赖项目/库：
====================================
	
====================================
todo:
====================================

*/
//-------------------------------------------------------------------------
#include "Include/FKCW_SimpleNet_NetObject.h"
//-------------------------------------------------------------------------