//*************************************************************************
//	创建日期:	2014-11-27
//	文件名称:	FKCW_3D.h
//  创 建 人:   王宏张 FreeKnight	
//	版权所有:	MIT
//	说    明:	
//*************************************************************************

#pragma once

//-------------------------------------------------------------------------
/* 
====================================
模块说明：	
====================================
	基于cocos2dx 2.2-x 版本追加的简单3D支持.
	注意的是本3D模块仅使用到cocos2dx的CCNode级别，并未使用cocos2dx的CCNode的派生类，请注意。
====================================
内部文件功能说明：
====================================
	
====================================
依赖项目/库：
====================================
====================================
todo:
====================================
*/ 
//-------------------------------------------------------------------------
#include "Include/FKCW_3D_Actor.h"
#include "Include/FKCW_3D_Root.h"
#include "Include/FKCW_3D_DefaultMeshes.h"
#include "Include/FKCW_3D_DefaultPassUniformCallback.h"
#include "Include/FKCW_3D_LightSource.h"
//-------------------------------------------------------------------------
#include "Include/FKCW_3D_FKSimpleModelLoader.h"