//-------------------------------------------------------------------------
#include "../Include/FKCW_3D_LightSource.h"
//-------------------------------------------------------------------------
FKCW_3D_LightSource::FKCW_3D_LightSource()
{
	// 默认值来自 OpenGL Programming Guide 第六章
	m_ambient.init(0, 0, 0, 1);
	m_diffuse.init(1, 1, 1, 1);
	m_specular.init(1, 1, 1, 1);
}
//-------------------------------------------------------------------------
FKCW_3D_LightSource::~FKCW_3D_LightSource()
{
}
//-------------------------------------------------------------------------