//*************************************************************************
//	创建日期:	2015-1-6
//	文件名称:	FKCW_IO_Macros.h
//  创 建 人:   王宏张 FreeKnight	
//	版权所有:	MIT
//	说    明:	
//*************************************************************************

#pragma once

//-------------------------------------------------------------------------
#include "cocos2d.h"
#include <string>
#include "../../FKCW_Base/FKCW_Base.h"
//-------------------------------------------------------------------------
USING_NS_CC;
using std::string;
//-------------------------------------------------------------------------
#if CC_TARGET_PLATFORM == CC_PLATFORM_WIN32
typedef int ssize_t;
#endif

#if CC_TARGET_PLATFORM == CC_PLATFORM_ANDROID
typedef long int ssize_t;
#endif
//-------------------------------------------------------------------------