//*************************************************************************
//	创建日期:	2015-1-3
//	文件名称:	FKCW_Story_Macros.h
//  创 建 人:   王宏张 FreeKnight	
//	版权所有:	MIT
//	说    明:	
//*************************************************************************

#pragma once

//-------------------------------------------------------------------------
#include "../../FKCW_Base/FKCW_Base.h"
//-------------------------------------------------------------------------
// 本Lib是否是提供给故事编辑器使用
#define FKCW_STORY_DESIGNER_TOOL		1
//-------------------------------------------------------------------------
// 节点TAG
#define TAG_MESSAGE_LAYER 10000
#define TAG_BG_COLOR_LAYER 10001
#define TAG_BG 10002
#define TAG_CLICK_LAYER 10003
//-------------------------------------------------------------------------
// z值
#define Z_MESSAGE_LAYER MAX_INT
#define Z_BG -MAX_INT
#define Z_BG_COLOR_LAYER (Z_BG + 1)
#define Z_CLICK_LAYER 0
//-------------------------------------------------------------------------