//*************************************************************************
//	创建日期:	2014-10-27
//	文件名称:	FKCW_Base_MD5.h
//  创 建 人:   王宏张 FreeKnight	
//	版权所有:	MIT
//	说    明:	
//*************************************************************************

#pragma once

//-------------------------------------------------------------------------
#include "FKCW_Base_Macro.h"
//-------------------------------------------------------------------------
class FKCW_Base_MD5
{
public:
	// 对一个字符串做md5
	static string md5( const char* s );
	// 对一段二进制数据流做md5
	static const char* md5( const void* p_pData, size_t p_unLen );
};