//*************************************************************************
//	创建日期:	2014-10-27
//	文件名称:	FKCW_Base_PinYinUtils.h
//  创 建 人:   王宏张 FreeKnight	
//	版权所有:	MIT
//	说    明:	
//*************************************************************************

#pragma once

//-------------------------------------------------------------------------
#include "FKCW_Base_Macro.h"
//-------------------------------------------------------------------------
class FKCW_Base_PinYinUtils
{
public:
	// 将一个中文字符串转换为拼音
	static string Chs2Pinyin(const string& s);
};
