//*************************************************************************
//	创建日期:	2014-10-30
//	文件名称:	FKCW_Json.h
//  创 建 人:   王宏张 FreeKnight	
//	版权所有:	MIT
//	说    明:	
//*************************************************************************

#pragma once

//-------------------------------------------------------------------------
/* 
====================================
模块说明：	
====================================
	Json格式解析库
====================================
内部文件功能说明：
====================================
	FKCW_Json_Parser
		Json加载器，也是对外主要接口。
	FKCW_Json_Array
		Json类型的一种，数组类型支持。
	FKCW_Json_Object
		Json类型的一种，对象类型支持。
	FKCW_Json_Value
		提供一组简便的类型转换函数。
====================================
依赖项目/库：
====================================
	yajl
	FKCW_Base
	FKCW_IO
====================================
todo:
====================================

*/
//-------------------------------------------------------------------------
#include "Include/FKCW_Json_Array.h"
#include "Include/FKCW_Json_Object.h"
#include "Include/FKCW_Json_Value.h"
#include "Include/FKCW_Json_Parser.h"