//*************************************************************************
//	创建日期:	2015-1-6
//	文件名称:	FKCW_Action_Macros.h
//  创 建 人:   王宏张 FreeKnight	
//	版权所有:	MIT
//	说    明:	
//*************************************************************************

#pragma once

//-------------------------------------------------------------------------
#include "cocos2d.h"
#include "../../FKCW_Base/FKCW_Base.h"
#include "../../FKCW_Base/Include/FKCW_Base_ColorConvert.h"
#include "../../FKCW_Base/Include/FKCW_Base_Macro.h"
#include <string>
#include <math.h>
//-------------------------------------------------------------------------
USING_NS_CC;
using std::string;
//-------------------------------------------------------------------------