//*************************************************************************
//	创建日期:	2014-12-29
//	文件名称:	FKCW_3D_Root.h
//  创 建 人:   王宏张 FreeKnight	
//	版权所有:	MIT
//	说    明:	
//*************************************************************************

#pragma once

//-------------------------------------------------------------------------
#include "FKCW_3D_Macro.h"
#include "FKCW_3D_Node.h"
//-------------------------------------------------------------------------
class FKCW_3D_Root:public FKCW_3D_Node
{
public:
	FKCW_3D_Root();
	virtual~FKCW_3D_Root();

	bool init();
	virtual void visit();
	virtual bool isSceneNode3D(){return true;}
};
//-------------------------------------------------------------------------