//*************************************************************************
//	创建日期:	2014-11-5
//	文件名称:	FKCW_GR.h
//  创 建 人:   王宏张 FreeKnight	
//	版权所有:	MIT
//	说    明:	
//*************************************************************************

#pragma once

//-------------------------------------------------------------------------
/* 
====================================
模块说明：	
====================================
	手势识别和消息二次处理
====================================
内部文件功能说明：
====================================
	FKCW_GR_GestureRecognizer
		手势识别层基类（虚类）。它是本库内其他手势识别的基类，本身不具备特殊手势的识别功能。
		如果你需要扩展新的手势支持，请继承本类实现。
	FKCW_GR_LongPress
		长按手势。同一位置停滞0.5秒不提起，就视为长按操作。（时间可调整）
	FKCW_GR_Pan
		缓慢滑动手势。向一个方向滑动，例如iOS默认操作中的换屏操作。
	FKCW_GR_Pinch
		捏合，挤压动作。（iOS里常见默认操作是进行缩放）
	FKCW_GR_Swipe
		快速滑动动作。和pan不同是有速度时间要求，若单位时间内的滑动速度超过阀值，才可视为快速滑动动作。
	FKCW_GR_Tap
		点击动作，双击动作，多次连续点击动作。
====================================
依赖项目/库：
====================================
	无（cocos2dx原生相关库不算）
====================================
todo:
====================================

*/
//-------------------------------------------------------------------------
#include "Include/FKCW_GR_GestureRecognizer.h"
#include "Include/FKCW_GR_LongPress.h"
#include "Include/FKCW_GR_Pan.h"
#include "Include/FKCW_GR_Pinch.h"
#include "Include/FKCW_GR_Swipe.h"
#include "Include/FKCW_GR_Tap.h"