//*************************************************************************
//	创建日期:	2015-1-6
//	文件名称:	FKCW_Json_Macros.h
//  创 建 人:   王宏张 FreeKnight	
//	版权所有:	MIT
//	说    明:	
//*************************************************************************

#pragma once

//-------------------------------------------------------------------------
#include "cocos2d.h"
#include <map>
#include <string>
#include <vector>
#include "../../FKCW_Base/FKCW_Base.h"
#include "../../FKCW_IO/Include/FKCW_IO_AssetOutputStream.h"
//-------------------------------------------------------------------------
using std::map;
using std::string;
using std::vector;
//-------------------------------------------------------------------------