//*************************************************************************
//	创建日期:	2015-1-5
//	文件名称:	FKCW_Pixel_Macros.h
//  创 建 人:   王宏张 FreeKnight	
//	版权所有:	MIT
//	说    明:	
//*************************************************************************

#pragma once

//-------------------------------------------------------------------------
#include "../../FKCW_Base/FKCW_Base.h"
//-------------------------------------------------------------------------
extern CCSize	g_defaultPerPixelSize;		// 默认每像素大小
extern bool		g_isShowBoundingBox;		// 是否显示包围盒
extern bool		g_isPrintFragMat;			// 是否输出DEBUG片段颜色矩阵