//-------------------------------------------------------------------------
#include "FKEventLayer.h"
//-------------------------------------------------------------------------
FKEventLayer::FKEventLayer()
	: FKMapLayer( s_EventLayerID )
{
	SetLayerDepth( s_EventLayerID );
}
//-------------------------------------------------------------------------
FKEventLayer::~FKEventLayer()
{

}
//-------------------------------------------------------------------------
// 获取地图层类型( 返回 ENUM_MapImageLayerType )
int FKEventLayer::GetLayerType()
{
	return eMILT_Event;
}
//-------------------------------------------------------------------------